app/views/home/index.html.erb

          <% if current_user.is_super_user? %>
              Total Users = <%= User.all.count %>
---
SELECT `users`.* FROM `users`

          <% else %>
              Total Timesheets = <%= link_to current_user.timesheets.count, timesheets_path%>
---
SELECT COUNT(*) FROM `timesheets` WHERE `timesheets`.`user_id` = 2
SELECT `timesheets`.* FROM `timesheets` WHERE `timesheets`.`user_id` = 2 ORDER BY timesheet_date DESC