app/views/projects/show_project_members.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      <div class="flt-lt">
        <span style="font-size: 16px;"><b><%= member.user.first_name + " " + member.user.last_name %></b></span><br/>