app/views/timesheets/_form.html.erb

        <td><%= f.label :project_id, "project" %></td>
        <td><%= f.select :project_id,options_for_select(current_user.approved_projects.map{|p| [p.name,p.id]}),:prompt => "Select Project" %></td>
---
SELECT `user_projects`.* FROM `user_projects` WHERE `user_projects`.`user_id` = 2