app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def show
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def edit
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`created_at`, `department`, `desc`, `end_date`, `name`, `start_date`, `updated_at`) VALUES ('2013-01-21 12:50:34', 'ROR', 'Maroozle', '2013-12-30', 'Maroozle', '2012-04-10', '2013-01-21 12:50:34')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
UPDATE `projects` SET `desc` = 'TMS is a time management, timesheet, time tracking solution. It enables you to track your work time, projects you work on and tasks you perform. It is web based and can be used from any location at any time.', `updated_at` = '2013-01-21 14:28:14' WHERE `projects`.`id` = 2

  def show_project_members
    @project = Project.find(params[:id])
---
SELECT `user_projects`.* FROM `user_projects` WHERE `user_projects`.`project_id` = 1