app/controllers/timesheets_controller.rb

SELECT `timesheets`.* FROM `timesheets` WHERE `timesheets`.`user_id` = 2 ORDER BY timesheet_date DESC
---
  def index
    @timesheets = current_user.timesheets.all(:order => 'timesheet_date DESC')