app/controllers/user_sessions_controller.rb

 def destroy
   current_user_session.user.update_attributes(:logged_in => false)
---
UPDATE `users` SET `last_request_at` = '2013-01-21 13:27:53', `perishable_token` = 'IpL1aJplzF4I2RQb4iKu', `updated_at` = '2013-01-21 13:27:53' WHERE `users`.`id` = 1