app/controllers/user_projects_controller.rb

SELECT `projects`.* FROM `projects` INNER JOIN `user_projects` ON `projects`.`id` = `user_projects`.`project_id` WHERE `user_projects`.`user_id` = 2
---
  def new
    @projects = Project.all - current_user.projects

INSERT INTO `user_projects` (`created_at`, `designation`, `project_id`, `updated_at`, `user_id`, `verified`) VALUES ('2013-01-21 12:50:52', 'Developer', 1, '2013-01-21 12:50:52', 2, 0)
---
  def create
    @user_project = UserProject.new(params[:user_project])
    if @user_project.save

SELECT `user_projects`.* FROM `user_projects` WHERE `user_projects`.`id` = 2 LIMIT 1
UPDATE `user_projects` SET `verified` = 1, `updated_at` = '2013-01-21 14:05:33' WHERE `user_projects`.`id` = 2
UPDATE `users` SET `last_request_at` = '2013-01-21 14:03:45', `perishable_token` = '8cavXiv2MgKkKVv2TbU', `updated_at` = '2013-01-21 14:03:45' WHERE `users`.`id` = 1
---
  def verify_project_membership
    @user_project = UserProject.find(params[:id])
    @user_project.update_attributes(:verified => true)