app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `dob`, `email`, `failed_login_count`, `first_name`, `is_super_user`, `last_login_at`, `last_login_ip`, `last_name`, `last_request_at`, `logged_in`, `login`, `login_count`, `password_salt`, `perishable_token`, `persistence_token`, `single_access_token`, `updated_at`) VALUES ('2013-01-21 13:28:44', '984ae685aa6d1f31e24bbb7604ddee2f0f371d58d3bdbb78fb3fcf51c02e9c738a094bcecacc361b8778ed6d1344235230cd1db4ca80fd840352a5da77d4e1bf', '2013-01-21 13:28:44', '127.0.0.1', '1990-06-13', 'amrendra.singh@intelegencia.com', 0, 'Amrendra', 0, NULL, NULL, 'Singh', '2013-01-21 13:28:44', 0, 'amrendra', 1, 'evhoD39K2rT1THcgHTiX', 'jRKszXq2SNyiyldKQAcg', '6ac0d4da7c42806aef570339f8609f2bdfc5dcb479a2074c4b112b8542359a06fe7aed754d3044cd1d9a657f0ec41bc4f1f85500d6ea5abcdc48c9f1af753c0e', 'x4V8bpVKjeYHgchfAoGW', '2013-01-21 13:28:44')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `first_name` = 'Admin', `last_name` = 'User', `perishable_token` = '6PBhv6kSH1WP8NWLMj', `updated_at` = '2013-01-21 14:20:33' WHERE `users`.`id` = 1

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1